

				var map;
				var grayStyles = [
				{
				  featureType: "all",
				  stylers: [
					  { saturation: -90 },
					  { lightness: 10 }
				  ]
				},
				];
				function initialize() {
						var myOptions = {
						styles: grayStyles,
						zoom: 9,
						scrollwheel: false,
						mapTypeId: google.maps.MapTypeId.ROADMAP
				};
				var all = [

						["Nescafe IMAX", "г. Москва, ул. Правобережная, д.1Б (ТЦ «Ашан Сити)", "55.8807976", "37.4470581"],
						["Каро Фильм на Байконурской", "г. Санкт-Петербург, ул. Байконурская, д.14А (ТРК «Континент)", "60.0020692", "30.2705494"],
						["Каро Фильм Октябрь", "г. Москва, ул. Новый Арбат, д.24 ", "55.7531", "37.5852782"],
						["Киномакс IMAX", "г. Рязань, Московское шоссе, д. 21 (ТРЦ «Премьер)", "54.6343452", "39.6863713"],
						["Киномакс IMAX Ярмарка", "г. Астрахань, пл. Вокзальная д. 13 (ТРЦ «Ярмарка)", "46.3597117", "48.0533785"],
						["Киномакс-Кожуховская", "Г. Москва, 7-ая Кожуховская, 9, ТЦ «Мозаика», 3 этаж  (м. Кожуховская)", "55.71065", "37.6728813"],
						["Киномакс-Пражская", "г. Москва, Кировоградская, 13а, ТРЦ «Columbus», 3 этаж (м. Пражская)", "55.6116869", "37.6051485"],
						["Киностар De Lux Теплый Стан", "г. Москва, МКАД, 41-й км (ТЦ «Мега Теплый стан) ", "55.6036291", "37.4898721"],
						["Киностар New York Белая Дача", "г. Москва, 14 км МКАД (ТЦ «Мега Белая Дача) ", "55.6557111", "37.8331668"],
						["Киностар Химки", "г. Химки, 24-й км Ленинградского ш., ТРК «Мега»", "55.8983634", "37.3994019"],
						["Кронверк Синема Виктория Плаза", "г. Рязань Первомайский проспект, д. 70, к. 1 (ТРЦ «Виктория-Плаза») ", "54.6303955", "39.7076931"],
						["Кронверк Синема Макси", "г. Сыктывкар, Октябрьский пр., д. 141 (ТРЦ «Макси»)", "61.6984924", "50.7993395"],
						["Монитор  Семь звезд", "г. Краснодар, ул. Уральская 79/1", "45.0346802", "39.0504815"],
						["Монитор Киноцентр", "Краснодарский край, 353451, г. Анапа, ул. Астраханская, д.99", "44.8801133", "37.337293"],
						["Мори Синема (Мытищи)", "г.Мытищи, Мира, стр. 51, ТРЦ «Июнь»", "55.919851", "37.7062493"],
						["Мори Синема Тольятти", "Тольятти, Автозаводское шоссе, д.6", "55.919851", "37.7062493"],
						["Синема Парк", "г. Челябинск, Артиллерийская, 136, ТРЦ «Горки", "55.1644252", "61.4287985"],
						["Синема Парк DELUXE в ТРЦ Радуга", "г. Санкт-Петербург, просп. Космонавтов, 14, «Питер-Радуга", "55.919851", "37.7062493"],
						["Синема Парк Starlight на Урале", "г. Екатеринбург, ул. Малышева, д.5 (ТРК «Алатырь) ", "56.8323959", "60.5807693"],
						["Синема Парк Аквамолл", "г. Ульяновск, Засвияжский район, Московское шоссе, д. 108 (ТРЦ «Аквамолл) ", "54.3059005", "48.3574729"],
						["СИНЕМА ПАРК в ТРЦ Галерея Eнисей", "ул. Дубровинского, 1И, Красноярск, Красноярский край, 660049", "56.009046", "92.8863521"],
						["Синема Парк Галерея Чижова", "г. Воронеж, ул. Кольцовская, д. 35 («Центр Галереи Чижова) ", "51.6663164", "39.1896317"],
						["Синема Парк Гудвин", "г. Тюмень, ул. Максима Горького, д.70 (ТРК «Гудвин) ", "57.1489036", "65.5589774"],
						["Синема Парк Европа", "г. Калининград, Профессора Баранова, 40", "54.7186021", "20.4993233"],
						["Синема Парк Европа Сити Молл", "г. Волгоград, просп. Ленина, д. 54 (ТРК «Европа Сити Молл) ", "48.7258893", "44.5413585"],
						["Синема Парк Космос", "Ставрополь, Доваторцев, 75а, ТРЦ «Космос» ", "44.9973397", "41.9229193"],
						["Синема Парк Ройял Парк", "г. Новосибирск, Красный просп., 101", "55.0557235", "82.9114276"],
						["Синема Парк Седьмое небо", "г. Нижний Новгород, ул. Бетанкура д.1 (ТРК «Седьмое небо) ", "56.3392894", "43.954907"],
						["Синема Парк Сургут Сити Молл", "г. Сургут, Югорский тракт, 38", "61.2392974", "73.3732908"],
						["Синема Парк Торговый квартал", "г. Набережные Челны, просп. Мира, д.3 (ТРК «Торговый квартал) ", "55.724779", "52.3788803"],
						["Синема Парк Триумф", "г. Саратов, ул. имени Зарубина, д. 167 (ТРК «Триумф Молл) ", "51.5414797", "46.0143165"],
						["Формула Кино IMAX", "г. Новокузнецк, ул. ДОЗ, 10, ТРЦ Планета", "53.7801976", "87.1248973"],
						["Формула Кино Галерея", "г. Санкт-Петербург, Лиговский просп., д.30А (ТЦ «Галерея) ", "59.927341", "30.3590569"],
						["Формула Кино Сити", "г. Москва, Пресненская наб., д.2 (ТРЦ «Афимолл Сити) ", "55.749416", "37.5391592"]


				];
				var infoWindow = new google.maps.InfoWindow;
				map = new google.maps.Map(document.getElementById('map_canvas'), myOptions);
				var startLat;
				var startLong
				navigator.geolocation.getCurrentPosition(
					function(position) {
						startLat = position.coords.latitude;
						startLong = position.coords.longitude;;
					}
				);
				var pos = new google.maps.LatLng(startLat ? startLat : 55.766172, startLong ? startLong : 37.601609);
				map.setCenter(pos);
				function infoCallback(infowindow, marker) {
						return function() {
						infowindow.open(map, marker);
				};
	 }
	 function setMarkers(map, all) {
		for (var i in all) {
						var name 	= all[i][0];
						var address = all[i][1];
						var lat 	= all[i][2];
						var lng 	= all[i][3];
						var image = 'https://kassa.rambler.ru/s/StaticContent/promo/alice/images/oval.png';
						var latlngset;
						latlngset = new google.maps.LatLng(lat, lng);
						var marker = new google.maps.Marker({
							map: map,
							position: latlngset,
							icon: image
						});
						var content = '<div class="map-content"><h3>' + name + '</h3>' + address + '<br />' + '</div>';
						var infowindow = new google.maps.InfoWindow();
							infowindow.setContent(content);
							google.maps.event.addListener(
								marker,
								'click',
								infoCallback(infowindow, marker)
							);
					}
				}
				setMarkers(map, all);
			};
			google.maps.event.addDomListener(window, 'load', initialize);